Repository: benjaminbreton/OC_project_12
Catalog: Carrots/Localizable/*.lproj/Localizable.strings
Languages: fr

# all.noName
source: No name
fr: Aucun nom

# all.name
source: Name
fr: Nom

# all.count
source: Count:
fr: Nombre:

# athletics.title
source: athletics
fr: sportifs

# athletics.title.maj
source: Athletics
fr: Sportifs

# athletics.title.sing.maj
source: Athletic
fr: Sportif

# athletics.none
source: No athletics have been added. To add an athletic, press the + button on the top of the screen, and set athletic's informations.
fr: Aucun sportif n'a été ajouté. Pour ajouter un sportif, appuyer sur le bouton + en haut de l'écran, et entrer les informations du sportif.

# athletics.details.creationDate
source: Creation date
fr: Date de création

# athletics.details.evolution
source: Evolution
fr: Évolution

# athletics.details.title
source: Profile
fr: Profil

# athletics.settings.nameLimit
source: You have to choose a name.
fr: Vous devez choisir un nom.

# athletics.settings.new
source: New athletic
fr: Nouveau sportif

# confirmation.title
source: Confirm
fr: Confirmer

# date.ask
source: select a date
fr: sélectionnez une date

# deletion.title
source: delete
fr: supprimer

# error.default.title
source: Error
fr: Erreur

# error.default.message
source: An error occurred.
fr: Une erreur est survenue.

# error.existingAthletic.title
source: Unavailable name
fr: Nom indisponible

# error.existingAthletic.message
source: An athletic already exists with this name. Please choose another.
fr: Un sportif existe déjà avec ce nom. Merci d'en choisir un autre.

# graphic.noEvolution
source: No evolution can be displayed the first day.
fr: Aucune évolution ne peut être affichée le premier jour.

# graphic.description
source: Points earned per hour the last 30 days.
fr: Points gagnés par heure les 30 derniers jours.

# help.proposal
source: Need some help ? click here
fr: Besoin d'aide ? cliquez ici

# help.title
source: Help:
fr: Aide :

# help.end
source: Click here again to close this help. You can disable all helps on the settings page.
fr: Cliquez de nouveau ici pour fermer l'aide. Vous pouvez désactiver toutes les aides dans la page paramètres.

# help.graphic
source: This graphic shows the evolution of the number of points earned per hour by the athletic. This number is obtained by dividing the total number of points earned by the athletic by the time elapsed since the athletic was added to the application. The lowest point of the curve below represents (values.min) points per hour. The highest point of the curve below represents (values.max) points per hour. The graphic's update happends the first time the application is open each day.
fr: Ce graphique montre l'évolution du nombre de points gagnés par heure par le sportif. Ce nombre est obtenu en divisant le nombre total de points gagnés par le sportif par le temps écoulé depuis son ajout dans l'application. Il est indiqué au-dessus du graphique la valeur du point le plus bas (min) ainsi que la valeur du point le plus haut (max) de la courbe. La mise à jour du graphique s'effectue une fois par jour lors du premier lancement de l'application.

# help.potsList
source: Here is the page where you can see all the pots, if you already have added some athletics. Each pot shows you its amount, and its expected value on a certain date if athletics keep doing performances on the same rythm. By choosing a pot, you can add or withdraw some money to it.
fr: Vous pouvez consulter ici la liste de toutes les cagnottes, si vous avez déjà ajouté un ou plusieurs sportifs. Chaque cagnotte indique son montant, et le montant prévisionnel à une certaine date si les sportifs continuent d'effectuer des performances au même rythme. En choisissant une cagnotte, vous pouvez y ajouter ou y soustraire de l'argent.

# help.potsAddings
source: On this page, you can add to or withdraw money from a pot. You just have to select an operation (add or withdraw money), and then enter the amount to add or withdraw. Hit confirmation's button when it's done.
fr: Sur cette page, vous pouvez ajouter à ou retirer de l'argent d'une cagnotte. Vous avez juste à sélectionner une opération (ajout ou retrait), entrer le montant, et confirmer quand c'est terminé.

# help.athleticsList
source: This page shows you the list of athletics. By choosing the plus button, you can add an athletic. By choosing an athletic, you can see his statistics and modify him. By stay pressed on an athletic, you can delete him.
fr: Cette page présente la liste des sportifs. En choisissant le bouton plus, vous pouvez ajouter un sportif. En choisissant un sportif, vous pouvez voir ses statistiques et le modifier. En restant appuyé sur un sportif, vous pouvez le supprimer.

# help.athleticsDetails
source: This page is an athletic's profile. You will see his informations, his evolution, and his performances. By stay pressed on a performance, you can delete it. This action will delete the athletic's participation on this performance, but not the performance itself (except if the athletic was alone). To delete the performance, you have to do the same action on the dedicated performances page.
fr: Cette page est le profil d'un sportif. Vous pouvez y voir ses informations, son évolution, et ses performances. En restant appuyé sur une performance, vous pouvez l'effacer. Cette action effacera la participation du sportif à cette performance, mais n'effacera pas la performance elle-même (sauf si le sportif était seul). Pour effacer une performance, vous devez effectuer la même action dans la page performances ci-dessous.

# help.athleticsSettings
source: To add or modify athletic, you have to choose its name. You can, if you want, add a picture. When it's done, click on the confirmation button.
fr: Pour ajouter ou modifier un sportif, vous devez choisir son nom. Vous pouvez, si vous le souhaitez, ajouter une image. Confirmez lorsque c'est terminé.

# help.sportsList
source: This page shows you the list of sports. By choosing the plus button, you can add a sport. By choosing a sport, you can see its details and eventually modify it. By stay pressed on a sport, you can delete it.
fr: Cette page présente la liste des sports. En choisissant le bouton +, vous pouvez ajouter un sport. En choisissant un sport, vous pouvez en consulter les détails et éventuellement le modifier. En restant appuyé sur un sport, vous pouvez le supprimer.

# help.sportsDetails
source: You can see on this page all informations about a sport : name, icon, unity to measure performances of this sport, the needed value to get one point (directly the number of points you can earn in case of one shot unity), and the performances. By stay pressed on a performance, you can delete it.
fr: Vous pouvez sur cette page toutes les informations concernant un sport : ses nom, icône, l'unité permettant de mesurer une performance, la valeur nécessaire pour gagner un point (directement le nombre de points gagnés dans le cas d'une unité en une fois), et les performances. En restant appuyé sur une performance, vous pouvez la supprimer.

# help.sportsSettings
source: To add or modify a sport, you have to choose its name. Then, choose the unity to measure each performance of this sport. Depending on the choosen unity, you have to set up the needed value to get one point. Finally, choose a picture. When it's done, you can click on the confirmation button.
fr: Pour ajouter un sport, vous devez choisir son nom. Ensuite, choisissez l'unité permettant de mesurer chaque performance de ce sport. Selon l'unité choisie, vous devrez entrer la valeur nécessaire pour l'obtention d'un point. Enfin, choisissez une icône. Quand c'est terminé, vous pouvez confirmer.

# help.performancesList
source: This page shows you the list of performances. By choosing the plus button, you can add a performance. By stay pressed on a performance, you can delete it (the deletion on this page will cancel all points earned because of it).
fr: Cette page présente la liste des performances. En choisissant le bouton +, vous pouvez ajouter une performance. En restant appuyé sur une performance, vous pourrez la supprimer (cela entraînera la suppression des points gagnés grâce à elle).

# help.performancesSettings
source: To add a performance: Choose athletics who did it. You can add several athletics. To add athletics : select an athletic on the list and click on the plus button. Choose performance's sport. Set the realised performance to convert it on points. Finally, choose a pot to add points : common pot, or athletics pots.
fr: Pour ajouter une performance: Choisissez les sportifs qui l'ont effectuée. Vous pouvez ajouter plusieurs sportifs. Pour ajouter des sportifs : sélectionner un sportif dans la liste et cliquer sur le bouton +. Choisissez le sport. Entrer la performance réalisée à convertir en points. Enfin, choisissez la cagnotte dans laquelle verser les points : cagnotte commune, ou celles des sportifs.

# icon.title
source: Icon
fr: Icône

# performances.none
source: No performances.
fr: Aucune performance.

# performances.none.noAthletics
source: No athletics have been added. To add an athletic: - go on athletics page below; - select the + button on the top of the screen; - add new athletic's informations and confirm.
fr: Aucun sportif n'a été ajouté. Pour ajouter un sportif : - aller dans la page sportifs ci-dessous ; - sélectionner le bouton + en haut de l'écran ; - ajouter les informations du nouveau sportif et confirmer.

# performances.none.noSports
source: No sports have been added. To add a sport: - go on sports page below; - select the + button on the top of the screen; - add new sport's informations and confirm.
fr: Aucun sport n'a été ajouté. Pour ajouter un sport : - aller dans la page sports ci-dessous ; - sélectionner le bouton + en haut de l'écran ; - ajouter les informations du nouveau sport et confirmer.

# performances.none.noPerformances
source: No performances have been added. To add a performance: - select the + button on the top of the screen; - add new performance's informations and confirm.
fr: Aucune performance n'a été ajoutée. Pour ajouter une performance : - sélectionner le bouton + en haut de l'écran ; - ajouter les informations de la nouvelle performance et confirmer.

# performances.oneShot
source: *one shot*
fr: *en une fois*

# performances.settings.sportsInstructions
source: Choose a sport
fr: Choisissez un sport

# performances.settings.addPotQuestion
source: Add points to common pot ?
fr: Ajouter les points à la cagnotte commune ?

# performances.settings.addExplanationsOn
source: Points will be added to the common pot.
fr: Les points seront ajoutés à la cagnotte commune.

# performances.settings.addExplanationsOff
source: Points will be added to each athletics pot.
fr: Les points seront ajoutés aux cagnottes de chacun des sportifs.

# performances.new
source: new performance
fr: nouvelle perf.

# picker.choices1
source: Choose 1
fr: Choisissez 1

# picker.choices1plus
source: Choose at least 1
fr: Choisissez au moins 1

# picker.chooseClick
source: Click here to choose
fr: Cliquez ici pour choisir

# pots.title
source: pots
fr: cagnottes

# pots.title.maj
source: Pots
fr: Cagnottes

# pots.noAthletics
source: No athletics have been added. To add an athletic: - go on athletics page below; - select the + button on the top of the screen; - add new athletic's informations and confirm.
fr: Aucun sportif n'a été ajouté. Pour ajouter un sportif : - aller dans la page sportifs ci-dessous ; - sélectionner le bouton + en haut de l'écran ; - ajouter les informations du nouveau sportif et confirmer.

# pots.athleticsPots
source: Athletics pots
fr: Cagnottes des sportifs

# pots.warning
source: Remember that the amounts displayed here are NOT money offered by the app and its owners; but amounts that the app offers you to set aside, from YOUR OWN MONEY, due to your efforts. It is therefore necessary to correctly set up the conversion of points into money in the settings page in line with your budget.
fr: Rappelez-vous que les sommes affichées ici ne correspondent PAS à de l'argent offert par l'application et ses propriétaires, mais des montants que l'application vous propose de mettre de côté, à partir de VOTRE PROPRE ARGENT, vu vos efforts. Il convient donc de paramétrer correctement, dans la page paramètres, la conversion des points en argent en accord avec votre budget.

# pots.addings.addPlaceholder
source: Amount to add
fr: Montant à ajouter

# pots.addings.addTitle
source: + add money
fr: + ajouter de l'argent

# pots.addings.withdrawTitle
source: - withdraw money
fr: - retirer de l'argent

# pots.addings.withdrawPlaceholder
source: Amount to withdraw
fr: Montant à retirer

# pots.addings.modificationTitle
source: Modification type
fr: Type de modification

# pots.addings.modificationInstructions
source: Choose the modification to do.
fr: Choisissez une modification à effectuer.

# pots.addings.amountTitle
source: Amount
fr: Montant

# pots.addings.amountLimitMin
source: You have to choose an amount.
fr: Vous devez choisir un montant.

# pots.commonPot
source: Common pot
fr: Cagnotte commune

# pots.commonPot.short
source: Common
fr: Commune

# pots.cell.expected
source: expected:
fr: prévision :

# pots.cell.noPrediction
source: no prediction the first day
fr: aucune prévision le premier jour

# settings.title
source: settings
fr: paramètres

# settings.date.title
source: Prevision date
fr: Date de prévision

# settings.date.explanations
source: The application provides, for each pot, an expected amount on a certain date if athletics keep adding performances on the same rythm. You can set this date here.
fr: L'application fournit, pour chaque cagnotte, un montant prévisionnel à une certaine date si les sportifs continuent d'effectuer des performances sur le même rythme. Vous pouvez choisir cette date ici.

# settings.conversion.title
source: Money conversion
fr: Conversion en argent

# settings.conversion.explanations1
source: In this application, athletics can earn points by doing some sports performances. Points can be converted in
fr: Dans cette application, les sportifs peuvent gagner des points en effectuant des performances. Les points peuvent être convertis en

# settings.conversion.explanations2
source: you can spend from your own money for each pot. Set this number correctly according to your means so that the application offers you amounts in line with your budget. Set here the necessary number of points to earn 1
fr: que vous pourrez dépenser de votre propre argent pour chaque cagnotte. Paramétrez correctement ce nombre en fonction de vos moyens afin que l'application vous propose des montants en adéquation avec votre budget. Entrez ici le nombre de points nécessaires pour obtenir 1

# settings.conversion.limitExplanationsMin
source: Enter a number.
fr: Entrez un nombre.

# settings.conversion.limitExplanationsMax
source: The number has to be inferior than 1,000.
fr: Le nombre doit être inférieur à 1 000.

# settings.help.title
source: Help
fr: Aide

# settings.help.question
source: Do you want help to be shown ?
fr: Voulez-vous que l'aide soit affichée ?

# settings.alert.title
source: Saved
fr: Sauvegardé

# settings.alert.message
source: The settings have been saved.
fr: Les paramètres ont été sauvegardés.

# sports.noSports
source: No sports have been added. To add a sport, press the + button on the top of the screen, and set sport's informations.
fr: Aucun sport n'a été ajouté. Pour ajouter un sport, appuyer sur le bouton + en haut de l'écran, et renseigner ses informations.

# sports.details.unityTitle
source: Measurement unity
fr: Unité de mesure

# sports.unityType.time.description
source: time
fr: temps

# sports.unityType.oneShot.description
source: one shot
fr: en une fois

# sports.unityType.count.description
source: count
fr: compte

# sports.unityType.time.placeholder1
source: hours
fr: heures

# sports.unityType.oneShot.placeholder1
source: earned points
fr: points gagnés

# sports.unityType.count.placeholder1
source: count
fr: compte

# sports.unityType.distance.explanations
source: You have to indicate here the necessary distance to reach to get one point.
fr: Vous devez indiquer la distance nécessaire pour gagner un point.

# sports.unityType.time.explanations
source: You have to indicate here the necessary exercice's duration to get one point.
fr: Vous devez indiquer la durée nécessaire de l'exercice pour gagner un point.

# sports.unityType.oneShot.explanations
source: You have to indicate here the number of points earned each time this sport has been made.
fr: Vous devez indiquer le nombre de points gagnés à chaque fois que ce sport sera effectué.

# sports.unityType.count.explanations
source: You have to indicate here the necessary count to get one point.
fr: Vous devez indiquer le compte nécessaire pour gagner un point.

# sports.details.oneShot
source: One shot:
fr: En une fois :

# sports.details.needs
source: Needs to get 1 point:
fr: Pour 1 point :

# sports.details.title
source: Details
fr: Détails

# sports.settings.limitName
source: You have to choose a name.
fr: Vous devez choisir un nom.

# sports.settings.valuePlaceholder
source: Choose an unity
fr: Choisissez une unité

# sports.settings.new
source: new sport
fr: nouveau sport

# sportValue.oneShotGain
source: By doing this sport, you'll earn
fr: En faisant ce sport, vous gagnerez

# sportValue.sportTitle
source: Points conversion
fr: Conversion en points
